In [ ]:
#show databases

In [ ]:
# create database db;
# CREATE DATABASE IF NOT EXISTS Baseball;

In [ ]:
# Backup database db to disk =’filepath’;
# Backup database db to disk=’filepath’ with differential;

In [ ]:
# use db;

In [ ]:
# Drop database db;
# DROP DATABASE IF EXISTS Baseball;

In [ ]:
# CREATE TABLE some_table;

# create table tutorials_tbl(
#    tid INT NOT NULL AUTO_INCREMENT,
#    title VARCHAR(100) NOT NULL,
#    sdate DATE,
#    PRIMARY KEY ( tid )
# );

In [ ]:
# show tables;

In [ ]:
# use tname;

In [ ]:
INSERT INTO tname(title)
VALUES(‘vamshi’),(’krishna’);
                                       # column by column
INSERT INTO tname(title2)
VALUES(‘vamshi’),(’krishna’);

In [1]:
#single single row
INSERT INTO department VALUES (1,'Neha','F','1994-06-03');

#multiple rows
INSERT INTO `my_table` (`field_1`, `field_2`) VALUES
('data_1', 'data_2'),
('data_1', 'data_3'),
('data_4', 'data_5');

SyntaxError: invalid syntax (Temp/ipykernel_7276/844790497.py, line 2)

## Querying data

In [ ]:
# Select from
SELECT 
    lastName, 
    firstName, 
FROM
    employees;

In [ ]:
# MySQL doesn’t require the FROM clause. It means that you can have a SELECT statement without the FROM clause like this:

SELECT select_list;
SELECT 1 + 1; 
SELECT NOW(); #time
SELECT CONCAT('John',' ','Doe');

In [ ]:
#dual table is a dummy table, not an actual table.
SELECT select_list
FROM dual;

In [2]:
SELECT * INTO New_table_name FROM old_table_name;     #copy

SyntaxError: invalid syntax (Temp/ipykernel_7276/2512728920.py, line 1)

In [ ]:
#Alias
SELECT expression AS column_alias;
SELECT expression column_alias;
SELECT CONCAT('John',' ','Doe') AS name;

## Sorting data

In [ ]:
#Order by
Select * from tname order by c1, c2;
Select * from tname order by country desc;
Select * from tname order by country asc, customername desc;
Select * from tname order by (c1,c2) Asc;              #need to test

In [ ]:
# LIMIT [offset,] row_count;     ---  if there is only 1 number then that is rowcount  from 0 to rowcount

Select * from tname limit 3;  #retrives only top 3 rows from database.

SELECT * FROM users ORDER BY id ASC LIMIT 2

SELECT *
FROM Customers
ORDER BY CustomerID
LIMIT 3;   #Always use ORDER BY when using LIMIT; otherwise the rows you will get will be unpredictable.

SELECT *
FROM Customers
ORDER BY CustomerID
LIMIT 4,3; # from 4th row to 4+3 = 7th row the 4,7 middle data will retreived

## Filtering data

In [ ]:
#Describe

Describe tname;  #Show all the fields of a table
Desc tname; # only feilds it will print no dataa
DESCRIBE databaseName.tableName;

In [ ]:
#where
Select * from tname where cid =1;
select * from tname where cname=’vamshi’;

SELECT 
    lastName, 
    firstName, 
    jobTitle, 
    officeCode
FROM
    employees
WHERE
    jobtitle = 'Sales Rep' OR 
    officeCode = 1
ORDER BY 
    officeCode , 
    jobTitle;

In [ ]:
#IN
SELECT 
    firstName, 
    lastName, 
    officeCod
FROM
    employees
WHERE
    officeCode IN (1 , 2, 3)
ORDER BY 
    officeCode;
    
#IS NULL
SELECT 
    lastName, 
    firstName, 
    reportsTo
FROM
    employees
WHERE
    reportsTo IS NULL;

In [ ]:
SELECT 
    lastname, 
    firstname, 
    jobtitle
FROM
    employees
WHERE
    jobtitle <> 'Sales Rep';
    
#Operators
=	Equal to. You can use it with almost any data type.
<> or !=	Not equal to
<	Less than. You typically use it with numeric and date/time data types.
>	Greater than.
<=	Less than or equal to
>=	Greater than or equal to

In [ ]:
#Like & wild cards
%  n no. of character     
_  single character

‘%a’;                    #end with a           
‘%po%’                   #between po should   there                                                                 
‘_a%’ ;                  #second letter should be a                                                
‘b__t’;                  #in middle b and t any 2 character should be there.

Select * from tname where cname like ‘a%’;    #finds name starts with a 


#[Charset]%   [!Charset]%

‘[p-r]%’                             #starting with p,q,r     
‘[bsp]%’                             #starting with b,s,p
‘[!p-r]%’                            #not start with p,q,r 
‘[!bsp]%’                            #not start with b,s,p   
h[^oa]t                              #not should be hot ,hat any other

Select * from tname where country not like ‘[bsp]%’

In [ ]:
#Distict

In [ ]:
Drop table tname; #DROP command deletes the data of the table as well as removes the entire structure.

In [ ]:
Truncate table tname;#TRUNCATE which only deletes the data of the tables

In [ ]:
#Delete
Delete from tname where cname=value;      #for deleting rows
Delete * from tname ; or delete from tname;

In [ ]:
SELECT st.name,st.percentage,
CASE 
    WHEN st.percentage >= 35 THEN 'Pass' ELSE 'Fail' 
END AS `Remark`
FROM student AS st ;

#or

SELECT st.name,st.percentage,
IF(st.percentage >= 35, 'Pass', 'Fail') AS `Remark`
FROM student 
AS st ;

SELECT OrderID, Quantity,
CASE
    WHEN Quantity > 30 THEN "The quantity is greater than 30"
    WHEN Quantity = 30 THEN "The quantity is 30"
    ELSE "The quantity is under 30"
END
FROM OrderDetails;

In [ ]:
#Distinct
Select * from tname;
Select distinct * from tname
Select c1,c2 from tname;
Select distinct c1,c2 from tname;

### And , or , not

In [4]:
Select c1,c2 from tname where c1=’vamshikrishna’ and c2 =’nakka’;
Select c1,c2 from tname where c1=’vamshikrishna’ or c2 =’nakka’;
Select c1,c2 from tname where not c1=’vamshikrishna’ ;

SyntaxError: invalid syntax (Temp/ipykernel_7276/4163674119.py, line 1)

### between , not between

In [ ]:
select * from tname where cname between 10 and 20;
select * from tname where cname not between 10 and 20;

#WHERE id NOT BETWEEN 10 and 20 is the same asWHERE (id < 10 OR id > 20).

### Is null , is not null:

In [5]:
Select c1,c2 from tname where c3 is null;
Select c1,c2 from tname where c3 is not null;

SyntaxError: invalid syntax (Temp/ipykernel_7276/3650342471.py, line 1)

### Alter

In [ ]:
Alter table tname rename to newtname;
Alter table tname add(cn datatype);
Alter table tname add cname datatype;
Alter table tname drop(cn); 
Alter table tname drop column cname;
Alter table tname change oldname to newname;                 #mysql
Alter table tname modify cname datatype;                    #for changing column datatype
Alter table tname modify(primary key(eid));
Alter table tname drop (primary key);

### Update

In [6]:
#used to modify the existing records in a table

Update tname set c1=v1 where c2=v2;   #warning: be care if we miss where clause total table will update
UPDATE mytable SET username="myuser" WHERE id=8

SyntaxError: invalid syntax (Temp/ipykernel_7276/1990712355.py, line 3)

### IN ,not In

In [7]:
Select * from tname where country in(‘india’,’pak’,’eng’);
Select * from tname where country not in(‘india’,’pak’,’eng’);
Select * from tname where country in ( select country from t2name);

SyntaxError: invalid syntax (Temp/ipykernel_7276/2322106299.py, line 1)

### Group by, Having

In [1]:
#We know that WHERE clause is used to place conditions on columns but what if we want to place conditions on groups?

SELECT SUBJECT, YEAR, Count(*)
FROM Student
GROUP BY SUBJECT, YEAR;


SELECT department, COUNT(*) AS "Man_Power"
FROM employees
GROUP BY department
HAVING COUNT(*) >= 10;


SELECT NAME, SUM(SALARY) FROM Employee 
GROUP BY NAME
HAVING SUM(SALARY)>3000;

SyntaxError: invalid syntax (Temp/ipykernel_12304/1357574038.py, line 1)

In [ ]:
Aggregate functions
AVG() – returns the average of a set.
COUNT() – returns the number of items in a set.
MAX() – returns the maximum value in a set.
MIN() – returns the minimum value in a set
SUM() – returns the sum of all or distinct values in a set.
Except for the COUNT() function, SQL aggregate functions ignore null.